Revit 2026 API

# UpdaterId Constructor

---

creates an instance of UpdaterId for given AddInId and a given GUID value

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UpdaterId(
	AddInId addInId,
	Guid val
)
```
```vb
Public Sub New (
	addInId As AddInId,
	val As Guid
)
```
```cpp
public:
UpdaterId(
	AddInId^ addInId,
	Guid val
)
```
```fsharp
new :
        addInId : AddInId *
        val : Guid -> UpdaterId
```

#### Parameters

addInId AddInId
     Id of addin that registers an Updater
val Guid
     a GUID identifying the Updater within addin

| Exception | Condition |
| --- | --- |
| ArgumentException | addInId is not valid. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

UpdaterId Class

Autodesk.Revit.DB Namespace